Конфигурация/src/DataProcessors/ПланированиеОтпуска/ПланированиеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПланированиеОтпуска</name>
</mdclass:DataProcessor>

Конфигурация/src/InformationRegisters/ПлановыеОтпуска/ПлановыеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПлановыеОтпуска</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/DataProcessors/ПланированиеОтпуска/Forms/Форма/Module.bsl
//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ОбработчикиСобытийФормы
//
//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы
//
//#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПлановыеОтпуска.Сотрудник КАК Сотрудник,
		|	ПлановыеОтпуска.ДатаНачала КАК ДатаНачала,
		|	ПлановыеОтпуска.ДатаОкончания КАК ДатаОкончания,
		|	ПлановыеОтпуска.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПлановыеОтпуска КАК ПлановыеОтпуска
		|ГДЕ
		|	ПлановыеОтпуска.ДатаНачала < &КонецПериода
		|	И ПлановыеОтпуска.ДатаОкончания > &НачалоПериода";
		
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	// ДиаграммаГанта является реквизитом формы типа ДиаграммаГанта.
	ДиаграммаГанта.Очистить();
	
	СерияДиаграммы = ДиаграммаГанта.Серии.Добавить();
	СерияДиаграммы.Значение = "Отпуска";
	СерияДиаграммы.Текст = "Отпуска";
	
	УникальныеТочкиСотрудников = Новый Соответствие();
	
	Пока Выборка.Следующий() Цикл
		
		ТочкаДиаграммы = УникальныеТочкиСотрудников.Получить(Выборка.Сотрудник);
		
		Если ТочкаДиаграммы = Неопределено Тогда
			
			ТочкаДиаграммы = ДиаграммаГанта.Точки.Добавить();
			ТочкаДиаграммы.Значение = Выборка.Сотрудник;
			ТочкаДиаграммы.Текст = Строка(Выборка.Сотрудник);
			УникальныеТочкиСотрудников.Вставить(Выборка.Сотрудник, ТочкаДиаграммы);
			
		КонецЕсли;
	
		ЗначениеТочки = ДиаграммаГанта.ПолучитьЗначение(ТочкаДиаграммы, СерияДиаграммы);
		
		ИнтервалОтпуска = ЗначениеТочки.Добавить();
		ИнтервалОтпуска.Начало = Выборка.ДатаНачала;
		ИнтервалОтпуска.Конец = Выборка.ДатаОкончания;
		ИнтервалОтпуска.Расшифровка = Выборка.Регистратор;
		
	КонецЦикла;
	
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Ложь;
	ДиаграммаГанта.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);
	
//	// Образец кода для заполнения диаграммы Ганта с сайта
//	
//	ДиаграммаГанта.Обновление = Ложь;
//	
//	ДиаграммаГанта.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
//	
//	СерияПлан = ДиаграммаГанта.Серии.Добавить();
//	СерияПлан.Текст = "Планируемые затраты";
//	
//	ТипРеквизитаКолонкиОтветственныйМассив = Новый Массив;
//	ТипРеквизитаКолонкиОтветственныйМассив.Добавить(Тип("Строка"));
//	ОписаниеТиповКолонкиОтветственный = Новый ОписаниеТипов(ТипРеквизитаКолонкиОтветственныйМассив);
//	РеквизитФормыКолонкиОтветственный = Новый РеквизитФормы("Ответственный", ОписаниеТиповКолонкиОтветственный, "ДиаграммаГанта");
//	ДобавляемыеРеквизитыМассив = Новый Массив;
//	ДобавляемыеРеквизитыМассив.Добавить(РеквизитФормыКолонкиОтветственный);
//	ИзменитьРеквизиты(ДобавляемыеРеквизитыМассив);
//	
//	ДиаграммаТаблицаОтветственный = Элементы.Добавить("ДиаграммаТаблицаОтветственный", Тип("ПолеФормы"), Элементы.ДиаграммаТаблица);
//	ДиаграммаТаблицаОтветственный.Вид = ВидПоляФормы.ПолеВвода;
//	ДиаграммаТаблицаОтветственный.ПутьКДанным = "ДиаграммаГанта.Ответственный";
//	ДиаграммаТаблицаОтветственный.Заголовок = "Ответственный";
//	
//	ТочкаПроектирование = ДиаграммаГанта.Точки.Добавить();
//	ТочкаПроектирование.Текст = "Проектирование";
//	ЗначениеПроектирование = ДиаграммаГанта.ПолучитьЗначение(ТочкаПроектирование, СерияПлан);
//	ЗначениеПроектирование.Данные.Ответственный = "Иванов И.И.";
//	ИнтервалПроектирование = ЗначениеПроектирование.Добавить();
//	ИнтервалПроектирование.Начало = Дата("20220115000000");
//	ИнтервалПроектирование.Конец = Дата("20220310000000");
//	
//	ТочкаПодготовительныеРаботы = ДиаграммаГанта.Точки.Добавить();
//	ТочкаПодготовительныеРаботы.Текст = "Подготовительные работы";
//	ЗначениеПодготовительныеРаботы = ДиаграммаГанта.ПолучитьЗначение(ТочкаПодготовительныеРаботы, СерияПлан);
//	ЗначениеПодготовительныеРаботы.Данные.Ответственный = "Петров А.В.";
//	ИнтервалПодготовительныеРаботы = ЗначениеПодготовительныеРаботы.Добавить();
//	ИнтервалПодготовительныеРаботы.Начало = Дата("20220315000000");
//	ИнтервалПодготовительныеРаботы.Конец = Дата("20220520000000");
//	
//	ТочкаОсновныеРаботы = ДиаграммаГанта.Точки.Добавить();
//	ТочкаОсновныеРаботы.Текст = "Основные работы";
//	ЗначениеОсновныеРаботы = ДиаграммаГанта.ПолучитьЗначение(ТочкаОсновныеРаботы, СерияПлан);
//	ЗначениеОсновныеРаботы.Данные.Ответственный = "Сидоров В.Г.";
//	ИнтервалОсновныеРаботы = ЗначениеОсновныеРаботы.Добавить();
//	ИнтервалОсновныеРаботы.Начало = Дата("20220529000000");
//	ИнтервалОсновныеРаботы.Конец = Дата("20230805000000");
//	
//	ТочкаОсновныеРаботыСтроительноМонтажныеРаботы = ТочкаОсновныеРаботы.Точки.Добавить();
//	ТочкаОсновныеРаботыСтроительноМонтажныеРаботы.Текст = "Строительно-монтажные работы";
//	ЗначениеОсновныеРаботыСтроительноМонтажныеРаботы = ДиаграммаГанта.ПолучитьЗначение(ТочкаОсновныеРаботыСтроительноМонтажныеРаботы, СерияПлан);
//	ЗначениеОсновныеРаботыСтроительноМонтажныеРаботы.Данные.Ответственный = "Леохин А.Р.";
//	ИнтервалОсновныеРаботыСтроительноМонтажныеРаботы = ЗначениеОсновныеРаботыСтроительноМонтажныеРаботы.Добавить();
//	ИнтервалОсновныеРаботыСтроительноМонтажныеРаботы.Начало = Дата("20220529000000");
//	ИнтервалОсновныеРаботыСтроительноМонтажныеРаботы.Конец = Дата("20230305000000");
//	
//	ТочкаОсновныеРаботыОтделочныеРаботы = ТочкаОсновныеРаботы.Точки.Добавить();
//	ТочкаОсновныеРаботыОтделочныеРаботы.Текст = "Отделочные работы";
//	ЗначениеОсновныеРаботыОтделочныеРаботы = ДиаграммаГанта.ПолучитьЗначение(ТочкаОсновныеРаботыОтделочныеРаботы, СерияПлан);
//	ЗначениеОсновныеРаботыОтделочныеРаботы.Данные.Ответственный = "Стариков Е.П.";
//	ИнтервалОсновныеРаботыОтделочныеРаботы = ЗначениеОсновныеРаботыОтделочныеРаботы.Добавить();
//	ИнтервалОсновныеРаботыОтделочныеРаботы.Начало = Дата("20230225000000");
//	ИнтервалОсновныеРаботыОтделочныеРаботы.Конец = Дата("20230710000000");
//	
//	ТочкаОсновныеРаботыБлагоустройство = ТочкаОсновныеРаботы.Точки.Добавить();
//	ТочкаОсновныеРаботыБлагоустройство.Текст = "Благоустройство";
//	ЗначениеОсновныеРаботыБлагоустройство = ДиаграммаГанта.ПолучитьЗначение(ТочкаОсновныеРаботыБлагоустройство, СерияПлан);
//	ЗначениеОсновныеРаботыБлагоустройство.Данные.Ответственный = "Леонтьев П.П.";
//	ИнтервалОсновныеРаботыБлагоустройство = ЗначениеОсновныеРаботыБлагоустройство.Добавить();
//	ИнтервалОсновныеРаботыБлагоустройство.Начало = Дата("20230715000000");
//	ИнтервалОсновныеРаботыБлагоустройство.Конец = Дата("20230805000000");
//	
//	ТочкаСдачаОбъекта = ДиаграммаГанта.Точки.Добавить();
//	ТочкаСдачаОбъекта.Текст = "Сдача объекта в эксплуатацию";
//	ЗначениеСдачаОбъекта = ДиаграммаГанта.ПолучитьЗначение(ТочкаСдачаОбъекта, СерияПлан);
//	ЗначениеСдачаОбъекта.Данные.Ответственный = "Славутич Ф.Г.";
//	ИнтервалСдачаОбъекта = ЗначениеСдачаОбъекта.Добавить();
//	ИнтервалСдачаОбъекта.Начало = Дата("20230810000000");
//	ИнтервалСдачаОбъекта.Конец = Дата("20230825000000");
//	
//	Связь1 = ИнтервалПроектирование.Добавить(ИнтервалПодготовительныеРаботы);
//	Связь2 = ИнтервалПодготовительныеРаботы.Добавить(ИнтервалОсновныеРаботы);
//	Связь3 = ИнтервалОсновныеРаботы.Добавить(ИнтервалСдачаОбъекта);
//	
//	Для Каждого ТекущаяТочка Из ДиаграммаГанта.Точки Цикл
//	    ДиаграммаГанта.РазвернутьТочку(ТекущаяТочка, Истина);
//	КонецЦикла;
//	
//	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
